000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КафкаИсходящиеСообщения/КафкаИсходящиеСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КафкаИсходящиеСообщения</name>
  <resources>
    <name>СсылкаДляВыгрузки</name>
    <type>
      <types>BusinessProcessRoutePointRef</types>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>TaskRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>CatalogRef</types>
    </type>
  </resources>
  <resources>
    <name>ОтборДляВыгрузки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ПолноеНаименованиеОбъектаВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДанныеВыгрузки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СтатусВыгрузки</name>
    <type>
      <types>EnumRef.КафкаСтатус</types>
    </type>
  </resources>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВремяСоздания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПотока</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/КафкаСтатус/КафкаСтатус.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КафкаСтатус</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>Выгружен</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КафкаИсходящиеСообщения/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создает структуру с параметрами для записи в регистр исходящих сообщений Kafka
//
// Возвращаемое значение:
//   Структура:
//     * УникальныйИдентификатор - УникальныйИдентификатор - идентификатор сообщения
//     * ВремяСоздания - Число - время создания сообщения в миллисекундах
//     * НомерПотока - Число - номер потока для обработки
//     * СсылкаДляВыгрузки - Неопределено, Произвольный - ссылка на объект для выгрузки
//     * ОтборДляВыгрузки - Строка - отбор для выгрузки в хранилище значений
//     * ПолноеНаименованиеОбъектаВыгрузки - Строка - полное наименование объекта выгрузки
//     * ДанныеВыгрузки - Строка - данные для выгрузки
//     * СтатусВыгрузки - ПеречислениеСсылка.КафкаСтатус - статус выгрузки сообщения
//     * ТекстОшибки - Строка - строка с описанием ошибки выгрузки
Функция СтруктураЗаписи() Экспорт
	
	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("УникальныйИдентификатор", Новый УникальныйИдентификатор);
	СтруктураЗаписи.Вставить("ВремяСоздания", ТекущаяУниверсальнаяДатаВМиллисекундах());
	СтруктураЗаписи.Вставить("НомерПотока", 0);
	СтруктураЗаписи.Вставить("СсылкаДляВыгрузки", Неопределено);
	СтруктураЗаписи.Вставить("ОтборДляВыгрузки", "");
	СтруктураЗаписи.Вставить("ПолноеНаименованиеОбъектаВыгрузки", "");
	СтруктураЗаписи.Вставить("ДанныеВыгрузки", "");
	СтруктураЗаписи.Вставить("СтатусВыгрузки", Перечисления.КафкаСтатус.ПустаяСсылка());
	СтруктураЗаписи.Вставить("ТекстОшибки", "");

	Возврат СтруктураЗаписи;
	
КонецФункции

// Добавить запись в регистр по структуре.
//
// Параметры:
//   СтруктураЗаписи - Структура - ключи соответствуют измерениям и реквизитам регистра сведений:
//     * УникальныйИдентификатор - УникальныйИдентификатор - идентификатор сообщения
//     * ВремяСоздания - Число - время создания сообщения в миллисекундах
//     * НомерПотока - Число - номер потока для обработки
//     * СсылкаДляВыгрузки - Неопределено, Произвольный - ссылка на объект для выгрузки
//     * ОтборДляВыгрузки - Строка - отбор для выгрузки в виде текста
//     * ПолноеНаименованиеОбъектаВыгрузки - Строка - полное наименование объекта выгрузки
//     * ДанныеВыгрузки - Строка - данные для выгрузки
//     * СтатусВыгрузки - ПеречислениеСсылка.КафкаСтатус - статус выгрузки сообщения
//     * ТекстОшибки - Строка - строка с описанием ошибки выгрузки
Процедура ДобавитьЗаписьРегистра(СтруктураЗаписи) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КафкаИсходящиеСообщения.НомерПотока КАК НомерПотока
		|ИЗ
		|	РегистрСведений.КафкаИсходящиеСообщения КАК КафкаИсходящиеСообщения
		|ГДЕ
		|	КафкаИсходящиеСообщения.ПолноеНаименованиеОбъектаВыгрузки = &ПолноеНаименованиеОбъектаВыгрузки
		|	И КафкаИсходящиеСообщения.СтатусВыгрузки = ЗНАЧЕНИЕ(Перечисление.КафкаСтатус.Новый)";
	
	Запрос.УстановитьПараметр("ПолноеНаименованиеОбъектаВыгрузки", СтруктураЗаписи.ПолноеНаименованиеОбъектаВыгрузки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтруктураЗаписи.НомерПотока = Выборка.НомерПотока;
	КонецЕсли;

	ДобавитьЗапись(СтруктураЗаписи);

КонецПроцедуры

// Добавить запись в регистр по структуре.
//
// Параметры:
//   СтруктураЗаписи - Структура - ключи соответствуют измерениям и реквизитам регистра сведений:
//     * УникальныйИдентификатор - УникальныйИдентификатор - идентификатор сообщения
//     * ВремяСоздания - Число - время создания сообщения в миллисекундах
//     * НомерПотока - Число - номер потока для обработки
//     * СсылкаДляВыгрузки - Неопределено, Произвольный - ссылка на объект для выгрузки
//     * ОтборДляВыгрузки - Строка - отбор для выгрузки в виде текста
//     * ПолноеНаименованиеОбъектаВыгрузки - Строка - полное наименование объекта выгрузки
//     * ДанныеВыгрузки - Строка - данные для выгрузки
//     * СтатусВыгрузки - ПеречислениеСсылка.КафкаСтатус - статус выгрузки сообщения
//     * ТекстОшибки - Строка - строка с описанием ошибки выгрузки
Процедура ДобавитьЗаписьОбъекта(СтруктураЗаписи) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.УникальныйИдентификатор.Установить(СтруктураЗаписи.УникальныйИдентификатор);
	Наборзаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		СтруктураЗаписи.НомерПотока = НаборЗаписей[0].НомерПотока;
	КонецЕсли;
	
	ДобавитьЗапись(СтруктураЗаписи);

КонецПроцедуры

// Добавить запись в регистр по структуре.
//
// Параметры:
//   СтруктураЗаписи - Структура - ключи соответствуют измерениям и реквизитам регистра сведений:
//     * УникальныйИдентификатор - УникальныйИдентификатор - идентификатор сообщения
//     * ВремяСоздания - Число - время создания сообщения в миллисекундах
//     * НомерПотока - Число - номер потока для обработки
//     * СсылкаДляВыгрузки - Неопределено, Произвольный - ссылка на объект для выгрузки
//     * ОтборДляВыгрузки - Строка - отбор для выгрузки в виде текста
//     * ПолноеНаименованиеОбъектаВыгрузки - Строка - полное наименование объекта выгрузки
//     * ДанныеВыгрузки - Строка - данные для выгрузки
//     * СтатусВыгрузки - ПеречислениеСсылка.КафкаСтатус - статус выгрузки сообщения
//     * ТекстОшибки - Строка - строка с описанием ошибки выгрузки
Процедура ЗаписатьИзменениеСтатуса(СтруктураЗаписи) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.УникальныйИдентификатор.Установить(СтруктураЗаписи.УникальныйИдентификатор);
	НаборЗаписей.Отбор.ВремяСоздания.Установить(СтруктураЗаписи.ВремяСоздания);
	НаборЗаписей.Отбор.НомерПотока.Установить(СтруктураЗаписи.НомерПотока);
	НаборЗаписей.Прочитать();

	Запись = НаборЗаписей[0];

	ЗаполнитьЗначенияСвойств(Запись, СтруктураЗаписи);
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Добавить запись в регистр по структуре.
//
// Параметры:
//   СтруктураЗаписи - Структура - ключи соответствуют измерениям и реквизитам регистра сведений:
//     * УникальныйИдентификатор - УникальныйИдентификатор - идентификатор сообщения
//     * ВремяСоздания - Число - время создания сообщения в миллисекундах
//     * НомерПотока - Число - номер потока для обработки
//     * СсылкаДляВыгрузки - Неопределено, Произвольный - ссылка на объект для выгрузки
//     * ОтборДляВыгрузки - Строка - отбор для выгрузки в виде текста
//     * ПолноеНаименованиеОбъектаВыгрузки - Строка - полное наименование объекта выгрузки
//     * ДанныеВыгрузки - Строка - данные для выгрузки
//     * СтатусВыгрузки - ПеречислениеСсылка.КафкаСтатус - статус выгрузки сообщения
//     * ТекстОшибки - Строка - строка с описанием ошибки выгрузки
Процедура ДобавитьЗапись(СтруктураЗаписи) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.УникальныйИдентификатор.Установить(СтруктураЗаписи.УникальныйИдентификатор);
	НаборЗаписей.Отбор.ВремяСоздания.Установить(СтруктураЗаписи.ВремяСоздания);
	НаборЗаписей.Отбор.НомерПотока.Установить(СтруктураЗаписи.НомерПотока);
	Запись = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(Запись, СтруктураЗаписи);
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
